{
    "title": "Yetenekler",
    "skills": {
      "html": {
        "title": "Html",
        "content": "HTML, web sayfalarının yapısını ve içeriğini etiketlerle tanımlar."
      },
      "css": {
        "title": "Css",
        "content": "CSS, web sayfalarını stilize eder ve düzenler, renkleri ve fontları kontrol eder."
      },
      "expressjs": {
        "title": "Express Js",
        "content": "Express.js, hızlı ve ölçeklenebilir web uygulamaları oluşturmak için kullanılan bir çerçevedir."
      },
      "nextjs": {
        "title": "Next Js",
        "content": "Next.js, React uygulamaları için sunucu tarafı render'ı sağlar, SEO'yu artırır."
      },
      "tailwindcss": {
        "title": "Tailwind CSS",
        "content": "Tailwind CSS, duyarlı kullanıcı arayüzleri tasarlamak için kullanılan bir yardımcı sınıf çerçevesidir."
      },
      "dart": {
        "title": "Dart",
        "content": "Dart, hızlı ve yüksek performanslı uygulama geliştirmek için Flutter ile kullanılır."
      },
      "flutter": {
        "title": "Flutter",
        "content": "Flutter, mobil, web ve masaüstü için yerel olarak derlenmiş uygulamalar oluşturur."
      },
      "javascript": {
        "title": "JavaScript",
        "content": "JavaScript, web sayfalarına etkileşim ve dinamik davranış ekler."
      },
      "typescript": {
        "title": "TypeScript",
        "content": "TypeScript, JavaScript'e statik tip ekleyerek kod kalitesini artırır."
      },
      "react": {
        "title": "React",
        "content": "React, yeniden kullanılabilir bileşenler ve hızlı render ile etkileşimli kullanıcı arayüzleri oluşturur."
      },
      "node": {
        "title": "Node",
        "content": "Node.js, sunucuda JavaScript çalıştırarak ölçeklenebilir ağ uygulamaları sağlar."
      },
      "mongodb": {
        "title": "MongoDB",
        "content": "MongoDB, verileri esnek JSON belgeleri olarak saklayan bir NoSQL veritabanıdır."
      },
      "sass": {
        "title": "Sass",
        "content": "Sass, CSS'i değişkenler ve iç içe geçirme ile geliştirir, stil vermeyi kolaylaştırır."
      }
    }
  }
  