{
  "whoami": {
    "title": "Ben Kimim",
    "line1": "Çekici ve etkili kullanıcı arayüzleri oluşturmaya ve uygulamaya odaklanarak web ve Android uygulama geliştirmede 4 yılı aşkın kapsamlı deneyime sahibim. İş uygulamaları, e-ticaret, sosyal medya ve uzaktan eğitim gibi çeşitli projeler üzerinde çalıştım; bu da beni pazar gereksinimlerini anlayacak ve müşterilerin ihtiyaçlarını karşılayan etkili çözümler sunacak konuma getirdi.",
    "line2": "HTML, CSS, JavaScript, ReactJS ve ExpressJS gibi birden fazla dil ve teknolojiyi kullanma konusunda uzman, sorunları çözme ve uygulama performansını ve güvenliğini artırma konusunda olağanüstü yeteneklere sahip. Bir ekibin parçası olarak ve çok kültürlü çalışma ortamlarında çalışma becerisine sahibim ve her zaman sürekli mesleki gelişim için çabalıyorum ve yeniliğe ulaşmak ve kullanıcı deneyimini geliştirmek için en son metodolojileri ve teknik araçları kullanıyorum.",
    "line3": "Müşteri projelerinin başarısına katkıda bulunan ve isteklerini sürekli olarak karşılayan yenilikçi teknik çözümler sunmaya kendimi adadım."
  },

  "customerReveiews": {
    "title": "Müşteri Yorumları",
    "review1": {
      "name": "Ahmed Mohammed",
      "comment": "Abdullah, neyin gerektiğini hızlıca anlayan yetenekli bir programcı. Çalışmaları mükemmel ve her zaman zamanında teslim ediliyor. Onunla çalışmayı kesinlikle tavsiye ederim.",
      "service": "MERN Yığını Kullanarak Web Sitesi Geliştirme"
    },
    "review2": {
      "name": "Emily Davis",
      "comment": "Abdullah ile birkaç projede çalıştım ve her zaman olağanüstü iş ve yenilikçi çözümler sunuyor. Çok işbirlikçi ve sabırlı.",
      "service": "Flutter Kullanarak Android Uygulama Geliştirme"
    },
    "review3": {
      "name": "Ömer Ahmed",
      "comment": "Abdullah, büyük bir profesyonellik ve detaylara dikkat ile çalışıyor. Sorunları hızlı ve etkili bir şekilde çözüyor. Onunla çalışmak mükemmel bir deneyimdi.",
      "service": "React Teknolojilerini Kullanarak Web Sitesi Geliştirme"
    }
  },

  "submit": "Gönder",
  "clicktoCopy": "Kopyalamak için tıklayın",
  "copied": "Kopyalandı",

  "getInTouch": {
    "title": "İletişime Geç",
    "firstName": "Ad",
    "lastName": "Soyad",
    "email": "E-posta",
    "phoneNumber": "Telefon Numarası",
    "messageTitle": "Mesajınız",
    "messagePlaceHolder": "Aklınızda ne var",
    "description": "Birlikte çalışmak mı istiyorsunuz yoksa çalışmalarım hakkında görüş bildirmek mi istiyorsunuz? Buradan başvurabilir ve size en kısa sürede yanıt verilecektir.",

    "errors": {
      "required": "Bu alan gereklidir.",
      "invalidEmail": "Geçersiz e-posta formatı."
    },

    "successMessage": "Mesaj başarıyla gönderildi. En kısa zamanda cevap verilecektir.",
    "errorMessage": "Mesaj gönderilirken bir hata oluştu. Lütfen daha sonra tekrar deneyin.",
    "sendingMessage": "Form gönderiliyor..."
  }
}
