{
  "slogan": "Programming is the <br /> <b> modern language of creativity </b>",
  "jobTitle": "Comprehensive developer of web and Android applications",

  "whoami": {
    "title": "who am I",

    "line1": "I have extensive experience spanning more than 4 years in web and Android application development, with a focus on creating and implementing attractive and effective user interfaces. I have worked on a variety of projects including business applications, e-commerce, social media, and distance learning, which has positioned me to understand market requirements and deliver effective solutions that meet customer needs.",
    "line2": "Proficient in using multiple languages ​​and technologies such as HTML, CSS, JavaScript, ReactJS, and ExpressJS, with exceptional abilities to solve problems and improve application performance and security. I have the ability to work as part of a team and in multicultural work environments, and I always strive for continuous professional development and use the latest methodologies and technical tools to achieve innovation and improve the user experience.",
    "line3": "I am committed to providing innovative technical solutions that contribute to the success of customer projects and meet their aspirations on an ongoing basis."
  },



  "customerReveiews": {
    "title": "Customer Reviews",
    "review1": {
      "name": "Ahmed Mohammed",
      "comment": "Abdullah is a skilled programmer who quickly understands what is needed. His work is excellent and always delivered on time. I highly recommend working with him.",
      "service": "Website Development using MERN Stack"
    },
    "review2": {
      "name": "Emily Davis",
      "comment": "I have worked with Abdullah on several projects, and he always delivers outstanding work and innovative solutions. He is very cooperative and patient.",
      "service": "Android App Development using Flutter"
    },
    "review3": {
      "name": "Omar Ahmed",
      "comment": "Abdullah works with great professionalism and attention to detail. He solves problems quickly and effectively. Working with him was an excellent experience.",
      "service": "Website Development using React Technologie"
    }
  },

  "submit": "Submit",
  "clicktoCopy": "Click to copy",
  "copied": "Copied",

  "getInTouch": {
    "title": "Get In Touch",
    "firstName": "First Name",
    "lastName": "Last Name", 
    "email": "Email",
    "phoneNumber": "Phone Number",
    "messageTitle": "Your Message",
    "messagePlaceHolder": "What do you have in mind",

    "description": "Do you want to work together or want to give your opinion on my work? You can apply here and you will be answered as soon as possible.",

    "errors": {
      "required": "this field is required.",
      "invalidEmail": "invalid email format."
    },

    "successMessage": "The message has been sent successfully. You will be answered as soon as possible.",
    "errorMessage": "An error occurred while sending the message. Please try again later.",
    "sendingMessage": "Sending the form..."
  },

  "services": {
    "title": "Services",
    "contactUs": "Contact us now",
    "services": {
      "service1": {
        "iconName": "fullStackMern",
        "title": "Full-Stack Web Development with MERN Stack",
        "description": "Building comprehensive web applications using MongoDB, Express.js, React.js, and Node.js."
      },
      "service2": {
        "iconName": "frontend",
        "title": "Front-End Development",
        "description": "Designing and developing responsive and interactive user interfaces using React.js and SCSS."
      },
      "service3": {
        "iconName": "backend",
        "title": "Back-End Development",
        "description": "Creating and managing server-side logic and databases using Node.js and Express.js for scalable applications."
      },
      "service4": {
        "iconName": "api",
        "title": "RESTful API Development",
        "description": "Designing and developing RESTful APIs for seamless integration between different systems."
      },
      "service5": {
        "iconName": "database",
        "title": "Database Management",
        "description": "Designing, optimizing, and managing databases using MongoDB to ensure performance and security."
      },
      "service6": {
        "iconName": "deployment",
        "title": "Deployment & Hosting",
        "description": "Deploying and hosting applications on platforms like Vercel and Heroku, ensuring stable and secure operations."
      },
      "service7": {
        "iconName": "android",
        "title": "Android Development with Flutter",
        "description": "Designing and developing fully functional Android applications using Flutter with a focus on modern design and user experience."
      },
      "service8": {
        "iconName": "firebase",
        "title": "Firebase Integration",
        "description": "Integrating Firebase services into Android apps for features like authentication, real-time databases, and push notifications."
      },
      "service9": {
        "iconName": "apiMobile",
        "title": "API Integration",
        "description": "Connecting Android apps to external APIs to enable seamless data interaction and extend app functionality."
      }

    }
  }
}
