{
  "title": "المشاريع",
  "github": "Github",
  "theWebsite": "الموقع الإلكتروني",
  "downloadApplication": "تحميل التطبيق",
  "emptyCategory": "لا يوجد أي مشروع في فئة...",
  "categories": {
    "all": "الكل",
    "frontend": "الواجهة الأمامية",
    "fullstack": "الواجهة الكاملة",
    "androidApplications": "تطبيقات أندرويد"
  },

  "projects": {
    "moviemagic": {
      "title": "Movie Magic",
      "description": "Movie Magic هو تطبيق ويب متقدم مبني باستخدام React، مصمم لمحبي الأفلام، ويتكامل بسلاسة مع API لمكتبة الأفلام TheMovieDB. يمكن للمستخدمين الوصول بسهولة إلى مكتبة أفلام شاملة، والبحث عن الأفلام، وإنشاء قائمة مشاهدة شخصية، وتتبع الأفلام التي تم مشاهدتها. واجهة التطبيق الحديثة والسهلة الاستخدام تعزز تجربة اكتشاف وإدارة الأفلام."
    },
    "chattyweb": {
      "title": "Chatty Web",
      "description": "Chatty Web هو تطبيق ويب سهل الاستخدام يوفر تجربة دردشة سلسة. بفضل واجهته البسيطة والفعالة، يمكن للمستخدمين التواصل بسهولة مع أصدقائهم، وإنشاء حسابات جديدة، وتسجيل الدخول. تركيزه على سهولة الاستخدام يجعل الدردشة بسيطة ومتاحة."
    },
    "tasktroveWeb": {
      "title": "Task Trove: Web App",
      "description": "TaskTrove هو تطبيق إدارة مهام قوي مبني باستخدام تقنية MERN. يمكن للمستخدمين إضافة المهام وتنظيمها وتحديد أولوياتها بفعالية، مع خيارات تصفية متقدمة وتكامل مع حساب Google. يتم مزامنة المهام بسلاسة مع التطبيق المحمول، مما يضمن الإنتاجية عبر جميع الأجهزة."
    },
    "tictaczone": {
      "title": "TicTacZone",
      "description": "TicTacZone هو منصة تفاعلية حيث يمكن للمستخدمين إنشاء والانضمام إلى غرف ألعاب Tic-Tac-Toe للتنافس مع الأصدقاء. يوفر التطبيق ميزات إضافية مثل الدردشة في الوقت الفعلي وإمكانية مشاهدة المتابعين للألعاب، مما يعزز تجربة اللعب العامة."
    },
    "tasktroveMobile": {
      "title": "TaskTrove: Mobile App",
      "description": "TaskTrove هو تطبيق إدارة مهام مبسط لأجهزة Android، مصمم للمزامنة بسلاسة مع تطبيق TaskTrove على الويب. يمكن للمستخدمين إضافة وتنظيم وتصنيف المهام بسهولة، مع تسجيل دخول مدمج عبر Google لراحة أكبر. سواء كنت في المنزل أو أثناء التنقل، يظل TaskTrove هو الحل الأمثل لإدارة مهامك."
    },
    "tnatoptan": {
      "title": "Tna Toptan",
      "description": "Tna Toptan هو تطبيق إدارة جملة متخصص مصمم للشركات. يتيح للمستخدمين إنشاء ومراقبة الطلبات، بينما يمكن للفريق الإداري الإشراف على تحديث حالات الطلبات. يتألف التطبيق من 8 صفحات وهو أداة خاصة، مخصصة للاستخدام الداخلي فقط."
    },
    "myportfolio": {
      "title": "My Portfolio",
      "description": "موقع إلكتروني لعرض أعمالي الشخصية كمطور متكامل. يتميز بتصميم حديث ومتجاوب مع أقسام لمراجعات العملاء، والخدمات المقدمة، والمشاريع البارزة، ونموذج الاتصال. تم تصميم الموقع لتوفير تجربة مستخدم سلسة عبر جميع الأجهزة ويعمل كمنصة احترافية لعرض مهاراتي وخبراتي في تطوير الويب."
    }
  }
}
