{
  "slogan": "البرمجة هي <br /><b> لفة الأبداع الحديثة</b>",
  "jobTitle": "مطور شامل لتطبيقات الويب والأندرويد",

  "navbar": {
    "whoami": "من أنا",
    "projects": "المشاريع",
    "services": "الخدمات",
    "academic_qualifications": "المؤهلات الأكاديمية",
    "getinTouch": "تواصل معنا"
  },

  "whoami": {
    "title": "من أنا",
    "line1": "لدي خبرة واسعة تمتد لأكثر من 4 سنوات في تطوير تطبيقات الويب والأندرويد، مع التركيز على إنشاء وتنفيذ واجهات مستخدم جذابة وفعالة. لقد عملت على مجموعة متنوعة من المشاريع بما في ذلك تطبيقات الأعمال، والتجارة الإلكترونية، والتواصل الاجتماعي، والتعليم عن بعد، مما أهلني لفهم متطلبات السوق وتقديم حلول فعالة تلبي احتياجات العملاء.",
    "line2": "أتقن استخدام لغات وتقنيات متعددة مثل HTML، CSS، JavaScript، ReactJS، وExpressJS، مع قدرات استثنائية في حل المشاكل وتحسين أداء وأمان التطبيقات. أمتلك القدرة على العمل كجزء من فريق وفي بيئات عمل متعددة الثقافات، وأسعى دائمًا للتطوير المهني المستمر واستخدام أحدث المنهجيات والأدوات التقنية لتحقيق الابتكار وتحسين تجربة المستخدم.",
    "line3": "أنا ملتزم بتقديم حلول تقنية مبتكرة تساهم في نجاح مشروعات العملاء وتلبي تطلعاتهم بشكل مستمر."
  },

  "skills": {
    "title": "المهارات",
    "html": {
      "title": "Html",
      "content": "Html هي لغة ترميز النصوص الفائقة المستخدمة لإنشاء وتصميم صفحات الويب، والتي تحدد بنية ومحتوى المستندات باستخدام العلامات والعناصر. إنها أساس تقنيات الويب إلى جانب CSS و JavaScript."
    },
    "css": {
      "title": "Css",
      "content": "css هي لغة تنسيق تستخدم لتصميم وتنسيق صفحات الويب، وتحدد مظهر وتخطيط العناصر المكتوبة بلغة HTML. يتيح لك التحكم في الألوان والخطوط والمسافات والتخطيطات لتوفير واجهات مستخدم جذابة ومتجاوبة."
    },
    "expressjs": {
      "title": "Express Js",
      "content": "express jsهو إطار عمل خفيف ومفتوح المصدر لـ Node.js، يُستخدم لبناء تطبيقات الويب وواجهات برمجة التطبيقات (APIs) بسرعة وكفاءة. يوفر مجموعة من الأدوات والميزات لتسهيل إدارة الطلبات والاستجابات وتوسيع التطبيقات."
    },
    "dart": {
      "title": "Dart",
      "content": "دارت هي لغة برمجة مفتوحة المصدر طورتها جوجل، تُستخدم لتطوير تطبيقات الويب والهواتف المحمولة عبر إطار عمل فلاتر. توفر دارت أداءً عاليًا ومعمارية حديثة لدعم تطوير التطبيقات بسرعة وقابلية الصيانة."
    },
    "flutter": {
      "title": "Flutter",
      "content": "فلاتر هو إطار عمل مفتوح المصدر من جوجل يُستخدم لبناء تطبيقات متكاملة عبر منصات متعددة (أندرويد وiOS) من قاعدة شيفرة واحدة. يعتمد على لغة دارت ويقدم أدوات وميزات لإنشاء واجهات مستخدم سلسة وجذابة."
    },
    "tailwindcss": {
      "title": "Tailwind CSS",
      "content": "متقن في استخدام Tailwind CSS لتصميم واجهات مستخدم حديثة، متجاوبة وجذابة بصريًا. ذو خبرة في تخصيص وتوسيع CSS القائم على الأدوات للتطوير السريع وأنظمة التصميم المتسقة."
    },
    "nextjs": {
      "title": "Next Js",
      "content": "بارع في تطوير تطبيقات React عالية الأداء والخوادم باستخدام Next.js. يمتلك خبرة في بناء مواقع ويب ديناميكية وملائمة لمحركات البحث واستغلال ميزات Next.js مثل توليد المواقع الثابتة (SSG) والتقديم من جانب الخادم (SSR) لتحسين تجربة المستخدم."
    },
    "javascript": {
      "title": "JavaScript",
      "content": "جافاسكريبت هي لغة برمجة تستخدم على نطاق واسع في تطوير تطبيقات الويب. تم تصميمها لتوفير صفحات ويب تفاعلية وديناميكية، وتتميز بقدرتها على التعامل مع الأحداث، وتغيير المحتوى، والتواصل مع الخوادم."
    },
    "typescript": {
      "title": "TypeScript",
      "content": "تايب سكريبت هي لغة برمجة مفتوحة المصدر طورتها مايكروسوفت تضيف ميزات الكتابة الثابتة إلى جافاسكريبت لتحسين اكتشاف الأخطاء وقابلية صيانة التعليمات البرمجية. يتم تحويل تعليمات تايب سكريبت البرمجية إلى جافاسكريبت للتنفيذ."
    },
    "react": {
      "title": "React",
      "content": "ريآكت هي مكتبة جافاسكريبت مفتوحة المصدر طورتها فيسبوك، وتستخدم لبناء واجهات تفاعلية وعالية الأداء لتطبيقات الويب. تعتمد على مبدأ المكونات لإعادة استخدام التعليمات البرمجية وتحسين إدارة الحالة."
    },
    "node": {
      "title": "Node",
      "content": "نود.جي إس هو بيئة تشغيل مفتوحة المصدر لتشغيل جافاسكريبت على الخادم، مما يمكن من بناء تطبيقات ويب عالية الأداء وقابلة للتوسع. يستخدم نموذج غير متزامن ومبني على الأحداث لمعالجة العمليات بكفاءة."
    },
    "mongodb": {
      "title": "MongoDb",
      "content": "مونغو دي بي هو قاعدة بيانات NoSQL مفتوحة المصدر، تستخدم لتخزين البيانات على شكل مستندات JSON مرنة وقابلة للتوسع، مما يجعلها مثالية لتطبيقات الويب الكبيرة والمعقدة. توفر أداءً عاليًا وقدرة على معالجة كميات كبيرة من البيانات بسرعة."
    },
    "sass": {
      "title": "SASS",
      "content": "ساس هي لغة تنسيق CSS محسّنة مفتوحة المصدر تمكن من استخدام المتغيرات، التداخل، والوظائف لتبسيط وصيانة تنسيقات CSS الكبيرة والمعقدة. يتم تحويل تعليمات ساس البرمجية إلى CSS للاستخدام في المواقع."
    }
  },

  "customerReveiews": {
    "title": "آراء العملاء",
    "review1": {
      "name": "أحمد محمد",
      "comment": "عبدالله مبرمج ماهر يفهم بسرعة ما هو مطلوب. عمله ممتاز ويتم تسليمه دائمًا في الوقت المحدد. أوصي بشدة بالعمل معه.",
      "service": "تطوير مواقع باستخدام MERN Stack"
    },
    "review2": {
      "name": "إميلي ديفيس",
      "comment": "لقد عملت مع عبدالله في عدة مشاريع، ودائمًا ما يقدم عملًا رائعًا وحلولًا مبتكرة. إنه متعاون جدًا وصبور.",
      "service": "تطوير تطبيقات أندرويد باستخدام Flutter"
    },
    "review3": {
      "name": "عمر أحمد",
      "comment": "عبدالله يعمل باحترافية كبيرة واهتمام بالتفاصيل. يحل المشاكل بسرعة وفعالية. كان العمل معه تجربة ممتازة.",
      "service": "تطوير مواقع باستخدام تقنيات React"
    }
  },

  "submit": "إرسال",
  "clicktoCopy": "انقر للنسخ",
  "copied": "تم النسخ",

  "getInTouch": {
    "title": "تواصل معي",
    "firstName": "الاسم الأول",
    "lastName": "الاسم الأخير",
    "email": "البريد الإلكتروني",
    "phoneNumber": "رقم الهاتف",
    "messageTitle": "رسالتك",
    "messagePlaceHolder": "ماذا يدور في ذهنك",
    "description": "هل ترغب في العمل معًا أو تقديم رأيك في عملي؟ يمكنك التقديم هنا وستتلقى ردًا في أقرب وقت ممكن.",

    "errors": {
      "required": "هذه الخانة مطلوبه.",
      "invalidEmail": "تنسيق البريد الإلكتروني غير صالح."
    },

    "successMessage": "تم إرسال الرسالة بنجاح. سيتم الرد عليك في أقرب وقت ممكن.",
    "errorMessage": "حدث خطأ أثناء إرسال الرسالة. الرجاء المحاولة مرة أخرى لاحقًا.",
    "sendingMessage": "جارٍ إرسال النموذج..."
  },

  "services": {
    "title": "الخدمات",
    "contactUs": "اتصل بنا الآن" ,
    "services": {
      "service1": {
        "iconName": "fullStackMern",
        "title": "تطوير ويب كامل باستخدام MERN",
        "description": "بناء تطبيقات ويب شاملة باستخدام MongoDB و Express.js و React.js و Node.js."
      },
      "service2": {
        "iconName": "frontend",
        "title": "تطوير الواجهة الأمامية",
        "description": "تصميم وتطوير واجهات مستخدم تفاعلية واستجابية باستخدام React.js و SCSS."
      },
      "service3": {
        "iconName": "backend",
        "title": "تطوير الخلفية",
        "description": "إنشاء وإدارة المنطق البرمجي على الخادم وقواعد البيانات باستخدام Node.js و Express.js لتطبيقات قابلة للتوسع."
      },
      "service4": {
        "iconName": "api",
        "title": "تطوير API RESTful",
        "description": "تصميم وتطوير واجهات API RESTful لتكامل سلس بين الأنظمة المختلفة."
      },
      "service5": {
        "iconName": "database",
        "title": "إدارة قواعد البيانات",
        "description": "تصميم وتحسين وإدارة قواعد البيانات باستخدام MongoDB لضمان الأداء والأمان."
      },
      "service6": {
        "iconName": "deployment",
        "title": "النشر والاستضافة",
        "description": "نشر واستضافة التطبيقات على منصات مثل Vercel و Heroku، وضمان عمليات مستقرة وآمنة."
      },

      "service7": {
        "iconName": "android",
        "title": "تطوير تطبيقات أندرويد باستخدام Flutter",
        "description": "تصميم وتطوير تطبيقات أندرويد كاملة الوظائف باستخدام Flutter مع التركيز على التصميم الحديث وتجربة المستخدم."
      },
      "service8": {
        "iconName": "firebase",
        "title": "دمج Firebase",
        "description": "دمج خدمات Firebase في تطبيقات أندرويد لميزات مثل المصادقة، وقواعد البيانات في الوقت الفعلي، والإشعارات الفورية."
      },
      "service9": {
        "iconName": "apiMobile",
        "title": "دمج API",
        "description": "ربط تطبيقات أندرويد بواجهات API الخارجية لتمكين التفاعل السلس مع البيانات وتوسيع وظائف التطبيق."
      }
    }
  }
}
