{
  "whoami": {
    "title": "من أنا",
    "line1": "لدي خبرة واسعة تمتد لأكثر من 4 سنوات في تطوير تطبيقات الويب والأندرويد، مع التركيز على إنشاء وتنفيذ واجهات مستخدم جذابة وفعالة. لقد عملت على مجموعة متنوعة من المشاريع بما في ذلك تطبيقات الأعمال، والتجارة الإلكترونية، والتواصل الاجتماعي، والتعليم عن بعد، مما أهلني لفهم متطلبات السوق وتقديم حلول فعالة تلبي احتياجات العملاء.",
    "line2": "أتقن استخدام لغات وتقنيات متعددة مثل HTML، CSS، JavaScript، ReactJS، وExpressJS، مع قدرات استثنائية في حل المشاكل وتحسين أداء وأمان التطبيقات. أمتلك القدرة على العمل كجزء من فريق وفي بيئات عمل متعددة الثقافات، وأسعى دائمًا للتطوير المهني المستمر واستخدام أحدث المنهجيات والأدوات التقنية لتحقيق الابتكار وتحسين تجربة المستخدم.",
    "line3": "أنا ملتزم بتقديم حلول تقنية مبتكرة تساهم في نجاح مشروعات العملاء وتلبي تطلعاتهم بشكل مستمر."
  },


  "customerReveiews": {
    "title": "آراء العملاء",
    "review1": {
      "name": "أحمد محمد",
      "comment": "عبدالله مبرمج ماهر يفهم بسرعة ما هو مطلوب. عمله ممتاز ويتم تسليمه دائمًا في الوقت المحدد. أوصي بشدة بالعمل معه.",
      "service": "تطوير مواقع باستخدام MERN Stack"
    },
    "review2": {
      "name": "إميلي ديفيس",
      "comment": "لقد عملت مع عبدالله في عدة مشاريع، ودائمًا ما يقدم عملًا رائعًا وحلولًا مبتكرة. إنه متعاون جدًا وصبور.",
      "service": "تطوير تطبيقات أندرويد باستخدام Flutter"
    },
    "review3": {
      "name": "عمر أحمد",
      "comment": "عبدالله يعمل باحترافية كبيرة واهتمام بالتفاصيل. يحل المشاكل بسرعة وفعالية. كان العمل معه تجربة ممتازة.",
      "service": "تطوير مواقع باستخدام تقنيات React"
    }
  },

  "submit": "إرسال",
  "clicktoCopy": "انقر للنسخ",
  "copied": "تم النسخ",

  "getInTouch": {
    "title": "تواصل معي",
    "firstName": "الاسم الأول",
    "lastName": "الاسم الأخير",
    "email": "البريد الإلكتروني",
    "phoneNumber": "رقم الهاتف",
    "messageTitle": "رسالتك",
    "messagePlaceHolder": "ماذا يدور في ذهنك",
    "description": "هل ترغب في العمل معًا أو تقديم رأيك في عملي؟ يمكنك التقديم هنا وستتلقى ردًا في أقرب وقت ممكن.",

    "errors": {
      "required": "هذه الخانة مطلوبه.",
      "invalidEmail": "تنسيق البريد الإلكتروني غير صالح."
    },

    "successMessage": "تم إرسال الرسالة بنجاح. سيتم الرد عليك في أقرب وقت ممكن.",
    "errorMessage": "حدث خطأ أثناء إرسال الرسالة. الرجاء المحاولة مرة أخرى لاحقًا.",
    "sendingMessage": "جارٍ إرسال النموذج..."
  },

  "services": {
    "title": "الخدمات",
    "contactUs": "اتصل بنا الآن" ,
    "services": {
      "service1": {
        "iconName": "fullStackMern",
        "title": "تطوير ويب كامل باستخدام MERN",
        "description": "بناء تطبيقات ويب شاملة باستخدام MongoDB و Express.js و React.js و Node.js."
      },
      "service2": {
        "iconName": "frontend",
        "title": "تطوير الواجهة الأمامية",
        "description": "تصميم وتطوير واجهات مستخدم تفاعلية واستجابية باستخدام React.js و SCSS."
      },
      "service3": {
        "iconName": "backend",
        "title": "تطوير الخلفية",
        "description": "إنشاء وإدارة المنطق البرمجي على الخادم وقواعد البيانات باستخدام Node.js و Express.js لتطبيقات قابلة للتوسع."
      },
      "service4": {
        "iconName": "api",
        "title": "تطوير API RESTful",
        "description": "تصميم وتطوير واجهات API RESTful لتكامل سلس بين الأنظمة المختلفة."
      },
      "service5": {
        "iconName": "database",
        "title": "إدارة قواعد البيانات",
        "description": "تصميم وتحسين وإدارة قواعد البيانات باستخدام MongoDB لضمان الأداء والأمان."
      },
      "service6": {
        "iconName": "deployment",
        "title": "النشر والاستضافة",
        "description": "نشر واستضافة التطبيقات على منصات مثل Vercel و Heroku، وضمان عمليات مستقرة وآمنة."
      },

      "service7": {
        "iconName": "android",
        "title": "تطوير تطبيقات أندرويد باستخدام Flutter",
        "description": "تصميم وتطوير تطبيقات أندرويد كاملة الوظائف باستخدام Flutter مع التركيز على التصميم الحديث وتجربة المستخدم."
      },
      "service8": {
        "iconName": "firebase",
        "title": "دمج Firebase",
        "description": "دمج خدمات Firebase في تطبيقات أندرويد لميزات مثل المصادقة، وقواعد البيانات في الوقت الفعلي، والإشعارات الفورية."
      },
      "service9": {
        "iconName": "apiMobile",
        "title": "دمج API",
        "description": "ربط تطبيقات أندرويد بواجهات API الخارجية لتمكين التفاعل السلس مع البيانات وتوسيع وظائف التطبيق."
      }
    }
  }
}
